Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Alternative browsers which use the latest version of WebKit, Blink, or Gecko, whether directly or via the platformâs web view API, are not explicitly supported. However, Weblate should (in most cases) display and function correctly in these browsers as well.
sv: Alternativa webblÃ¤sare som anvÃ¤nder den senaste versionen av WebKit, Blink eller Gecko, antingen direkt eller via plattformens webbvy-API, stÃ¶ds inte uttryckligen. Weblate bÃ¶r dock (i de flesta fall) visas och fungera korrekt Ã¤ven i dessa webblÃ¤sare.

source: Older browsers might work, but some features might be limited.
sv: Ãldre webblÃ¤sare kan fungera, men vissa funktioner kan vara begrÃ¤nsade.

source: Dependency management
sv: Beroendehantering

source: Installing and managing `3rd party` libraries in the `client` of a Django project can be a bit tricky. This section provides a step-by-step guide on how to install and manage 3rd party libraries used by the `client side` of Weblate using `Webpack`.
sv: Att installera och hantera tredjepartsbibliotek i klienten fÃ¶r ett Django-projekt kan vara lite knepigt. Det hÃ¤r avsnittet innehÃ¥ller en steg-fÃ¶r-steg-guide om hur man installerar och hanterar tredjepartsbibliotek som anvÃ¤nds av klientsidan i Weblate med hjÃ¤lp av Webpack.

source: Prerequisites
sv: FÃ¶rutsÃ¤ttningar

source: Before proceeding with an installation, make sure you have the following prerequisites:
sv: Innan du fortsÃ¤tter med installationen, se till att du uppfyller fÃ¶ljande krav:

source: ``Nodejs`` version 14 or higher.
sv: ``Nodejs`` version 14 eller hÃ¶gre.

source: The ``yarn`` package manager is installed on your system.
sv: Pakethanteraren ``yarn`` Ã¤r installerad pÃ¥ ditt system.

source: Run ``cd client``.
sv: KÃ¶r ``cd client``.

source: Run ``yarn install``.
sv: KÃ¶r ``yarn install``.

source: To install a library, first run the following command:
sv: FÃ¶r att installera ett bibliotek, kÃ¶r fÃ¶rst fÃ¶ljande kommando:

source: Importing the Library
sv: Importera biblioteket

source: Then, there are two ways to import the library:
sv: Sedan finns det tvÃ¥ sÃ¤tt att importera biblioteket:

source: If it is a project-wide library (it is used/needed in all/most pages):
sv: Om det Ã¤r ett projektomfattande bibliotek (det anvÃ¤nds/behÃ¶vs pÃ¥ alla/de flesta sidor):

source: Import the library in ``src/main.js``.
sv: Importera biblioteket i ``src/main.js``.

source: And declare it in the global scope (if needed).
sv: Och deklarera det i det globala omrÃ¥det (om det behÃ¶vs).

source: If it is page-specific library (library is used in a specific page or template):
sv: Om det Ã¤r en sidspecifik bibliotek (biblioteket anvÃ¤nds pÃ¥ en specifik sida eller mall):

source: Create a new file named ``src/<lib-name>.js``.
sv: Skapa en ny fil med namnet ``src/<lib-name>.js``.

source: Import the library in it. Then inject it into the ``window`` object to be globally accessible.
sv: Importera biblioteket i det. Injicera det sedan i objektet ``window`` sÃ¥ att det blir globalt tillgÃ¤ngligt.

source: Add an entry in ``webpack.config.js``: ``<lib-name>: "src/<lib-name>.js"``.
sv: LÃ¤gg till en post i ``webpack.config.js``: ``<lib-name>: "src/<lib-name>.js"``.

source: Add library name in ``excludePrefixes`` array in ``mainLicenseTransform`` in ``webpack.config.js``.
sv: LÃ¤gg till biblioteksnamnet i arrayen ``excludePrefixes`` i ``mainLicenseTransform`` i ``webpack.config.js``.

source: Add license file name in ``additionalFiles`` in ``LicensePlugin`` in ``plugins`` array in ``webpack.config.js``.
sv: LÃ¤gg till licensfilens namn i ``additionalFiles`` i ``LicensePlugin`` i ``plugins``-matrisen i ``webpack.config.js``.

source: Create a ``<lib-name>LicenseTransform`` function for the license file introduced in the previous steps and use it.
sv: Skapa en funktion ``<lib-name>LicenseTransform`` fÃ¶r licensfilen som introducerades i fÃ¶regÃ¥ende steg och anvÃ¤nd den.

source: Note: Replace ``<lib-name>`` with the actual name of the 3rd party library.
sv: Obs: ErsÃ¤tt ``<lib-name>`` med det faktiska namnet pÃ¥ tredjepartsbiblioteket.

source: Building the Library
sv: Bygga biblioteket

source: Build the libraries used by the project, by running the following command:
sv: Bygg biblioteken som anvÃ¤nds av projektet genom att kÃ¶ra fÃ¶ljande kommando:

source: Including the Library
sv: Inklusive biblioteket

source: Now the library is built and ready for use. To include it follow these steps:
sv: Nu Ã¤r biblioteket byggt och klart att anvÃ¤ndas. FÃ¶r att inkludera det, fÃ¶lj dessa steg:

source: If the library was imported in ``src/main.js``, no further steps are required (as it is already included in ``base.html``).
sv: Om biblioteket importerades i ``src/main.js`` krÃ¤vs inga ytterligare Ã¥tgÃ¤rder (eftersom det redan ingÃ¥r i ``base.html``).

source: If the library was imported in its specific file ``src/<lib-name>.js``, in ``weblate/templates`` use the include tags to link to the built static JavaScript file:
sv: Om biblioteket importerades i sin specifika fil ``src/<lib-name>.js``, anvÃ¤nd inkluderingsetiketterna i ``weblate/templates`` fÃ¶r att lÃ¤nka till den byggda statiska JavaScript-filen:

source: Coding style
sv: Kodningsstil

source: Weblate relies on `Biome`_ for formatting and linting the JavaScript and CSS code.
sv: Weblate anvÃ¤nder `Biome`_ fÃ¶r formatering och linting av JavaScript- och CSS-kod.

source: Localization
sv: ÃversÃ¤ttning

source: Should you need any user visible text in the frontend code, it should be localizable. In most cases, all you need is to wrap your text inside ``gettext`` function, but there are more complex features available:
sv: Om du behÃ¶ver nÃ¥gon text som Ã¤r synlig fÃ¶r anvÃ¤ndaren i frontend-koden, bÃ¶r den vara lokaliserbar. I de flesta fall behÃ¶ver du bara omsluta texten med funktionen ``gettext``, men det finns Ã¤ven mer komplexa funktioner tillgÃ¤ngliga:

source: :doc:`Translation topic in the Django documentation <django:topics/i18n/translation>`
sv: :doc:`ÃversÃ¤ttningstema i Django-dokumentationen <django:topics/i18n/translation>`

source: Weblate currently uses `Material Design Icons`_, in case you are looking for new symbol, check that.
sv: Weblate anvÃ¤nder fÃ¶r nÃ¤rvarande `Material Design Icons`_. Om du letar efter nya symboler kan du kolla dÃ¤r.

source: Additionally, there is :file:`scripts/optimize-svg` to reduce size of the SVG as most of the icons are embedded inside the HTML to allow styling of the paths.
sv: Dessutom finns :file:`scripts/optimize-svg` fÃ¶r att minska storleken pÃ¥ SVG-filen, eftersom de flesta ikonerna Ã¤r inbÃ¤ddade i HTML-koden fÃ¶r att mÃ¶jliggÃ¶ra formatering av banorna.

source: Contributing to Weblate
sv: Bidra till Weblate

source: There are dozens of ways to improve Weblate. You can choose the one you feel comfortable with, be it coding, graphics design, documentation, sponsorship, or an idea:
sv: Det finns dussintals sÃ¤tt att fÃ¶rbÃ¤ttra Weblate. Du kan vÃ¤lja det som passar dig bÃ¤st, oavsett om det Ã¤r kodning, grafisk design, dokumentation, sponsring eller en idÃ©:

source: Translating Weblate
sv: ÃversÃ¤tta Weblate

source: Weblate is continually being `translated <https://hosted.weblate.org/>`_ using Weblate itself. Feel free to take your part in the effort of making Weblate available in as many human languages as possible. It brings Weblate closer to its users!
sv: Weblate Ã¶versÃ¤tts kontinuerligt <https://hosted.weblate.org/>_ med hjÃ¤lp av Weblate sjÃ¤lv. Du Ã¤r vÃ¤lkommen att delta i arbetet med att gÃ¶ra Weblate tillgÃ¤ngligt pÃ¥ sÃ¥ mÃ¥nga sprÃ¥k som mÃ¶jligt. Det gÃ¶r Weblate mer tillgÃ¤ngligt fÃ¶r sina anvÃ¤ndare!

source: If you find a possible mistake in the source string, you can mark it with a comment in the Weblate editor. This way, it can be discussed and corrected. If youâre certain, you can also click on the link in the :guilabel:`Source string location` section and submit a PR with your correction.
sv: Om du hittar ett mÃ¶jligt fel i kÃ¤llstrÃ¤ngen kan du markera det med en kommentar i Weblate-redigeraren. PÃ¥ sÃ¥ sÃ¤tt kan det diskuteras och korrigeras. Om du Ã¤r sÃ¤ker kan du ocksÃ¥ klicka pÃ¥ lÃ¤nken i avsnittet :guilabel:`KÃ¤llstrÃ¤ngens plats` och skicka in en PR med din korrigering.

source: Weblate discussions
sv: Weblate-diskussioner

source: If you have an idea and not sure if itâs suitable for an issue, donât worry. You can join the community in `GitHub discussions <https://github.com/WeblateOrg/weblate/discussions>`_.
sv: Om du har en idÃ© och inte Ã¤r sÃ¤ker pÃ¥ om den passar fÃ¶r ett nummer, oroa dig inte. Du kan gÃ¥ med i communityn i `GitHub-diskussioner <https://github.com/WeblateOrg/weblate/discussions>`_.

source: Funding Weblate development
sv: Finansiering av Weblate-utvecklingen

source: You can boost Weblateâs development by donating. Funds collected on donations are used to enable gratis hosting for libre software projects and to fund the ecosystem Weblate relies on. Please check the `donate page <https://weblate.org/donate/>`_ for options, such as funding goals and the rewards you get as a proud funder.
sv: Du kan stÃ¶dja Weblates utveckling genom att donera. Pengar som samlas in genom donationer anvÃ¤nds fÃ¶r att mÃ¶jliggÃ¶ra gratis hosting fÃ¶r fri programvara och fÃ¶r att finansiera det ekosystem som Weblate Ã¤r beroende av. BesÃ¶k donationssidan <https://weblate.org/donate/> fÃ¶r information om olika alternativ, sÃ¥som finansieringsmÃ¥l och de belÃ¶ningar du fÃ¥r som stolt finansiÃ¤r.

source: Supporters who have funded Weblate
sv: Supportrar som har finansierat Weblate

source: List of Weblate supporters:
sv: Lista Ã¶ver Weblate-supportrar:

source: Do you want to be in the list? Please see options on the `Donate to Weblate <https://weblate.org/donate/>`_.
sv: Vill du vara med pÃ¥ listan? Se alternativen pÃ¥ `Donera till Weblate <https://weblate.org/donate/>`_.

source: Weblate internals
sv: Weblate internt

source: This chapter will give you basic overview of Weblate internals.
sv: I det hÃ¤r kapitlet fÃ¥r du en grundlÃ¤ggande Ã¶versikt Ã¶ver Weblates interna funktioner.

source: Weblate derives most of its code structure from, and is based on `Django`_.
sv: Weblate hÃ¤mtar stÃ¶rre delen av sin kodstruktur frÃ¥n och baseras pÃ¥ `Django`_.

source: Directory structure
sv: Katalogstruktur

source: Quick overview of directory structure of Weblate main repository:
sv: Snabb Ã¶versikt Ã¶ver katalogstrukturen i Weblates huvudarkiv:

source: Source code for this documentation, which can be built using `Sphinx <https://www.sphinx-doc.org/>`_.
sv: KÃ¤llkoden fÃ¶r denna dokumentation, som kan byggas med hjÃ¤lp av `Sphinx <https://www.sphinx-doc.org/>`_.

source: Docker code to run development server, see :ref:`dev-docker`.
sv: Docker-kod fÃ¶r att kÃ¶ra utvecklingsservern, se :ref:`dev-docker`.

source: Source code of Weblate as a `Django <https://www.djangoproject.com/>`_ application, see :ref:`internals`.
sv: KÃ¤llkoden fÃ¶r Weblate som en `Django <https://www.djangoproject.com/>`_ applikation, se :ref:`internals`.

source: Client files (CSS, Javascript and images), see :doc:`frontend`.
sv: Klientfiler (CSS, Javascript och bilder), se :doc:`frontend`.

source: Modules
sv: Moduler

source: Weblate consists of several Django applications (some optional, see :doc:`/admin/optionals`):
sv: Weblate bestÃ¥r av flera Django-applikationer (vissa Ã¤r valfria, se :doc:`/admin/optionals`):

source: User account, profiles and notifications.
sv: AnvÃ¤ndarkonto, profiler och aviseringar.

source: Add-ons to tweak Weblate behavior, see :ref:`addons`.
sv: TillÃ¤gg fÃ¶r att justera Weblates beteende, se :ref:`addons`.

source: API based on `Django REST framework`_.
sv: API baserat pÃ¥ `Django REST framework`_.

source: Authentication and permissions.
sv: Autentisering och behÃ¶righeter.

source: The optional :ref:`billing` module.
sv: Den valfria modulen :ref:`billing`.

source: Translation string :ref:`checks` module.
sv: ÃversÃ¤ttningsstrÃ¤ng :ref:`checks`-modul.

source: Font rendering checks module.
sv: Modul fÃ¶r kontroll av teckensnittsrendering.

source: File format abstraction layer based on translate-toolkit.
sv: Filformatabstraktionslager baserat pÃ¥ translate-toolkit.

source: The optional :ref:`git-exporter` module.
sv: Det valfria modulen :ref:`git-exporter`.

source: Module defining language and plural models.
sv: Modul som definierar sprÃ¥k och pluralmodeller.

source: The optional :ref:`legal` module.
sv: Det valfria modulen :ref:`legal`.

source: Integration of machine translation services.
sv: Integration av maskinÃ¶versÃ¤ttningstjÃ¤nster.

source: Built-in translation memory, see :ref:`translation-memory`.
sv: Inbyggt Ã¶versÃ¤ttningsminne, se :ref:`translation-memory`.

source: Screenshots management and OCR module.
sv: SkÃ¤rmdumpshantering och OCR-modul.

source: Main module handling translations.
sv: Huvudmodul som hanterar Ã¶versÃ¤ttningar.

source: Various helper utilities.
sv: Olika hjÃ¤lpprogram.

source: Version control system abstraction.
sv: Abstraktion av versionshanteringssystem.

source: Django admin interface customization.
sv: Anpassning av Djangos administratÃ¶rsgrÃ¤nssnitt.

source: Background tasks internals
sv: Bakgrundsuppgifter internt

source: This section describes Celery task internals. :ref:`celery` describes how to configure Celery to run the tasks.
sv: Detta avsnitt beskriver Celery-uppgiftens interna funktioner. :ref:`celery` beskriver hur man konfigurerar Celery fÃ¶r att kÃ¶ra uppgifterna.

source: Weblate uses Celery to execute tasks in the background. Some tasks are event-triggered, and some tasks are schedule-triggered.
sv: Weblate anvÃ¤nder Celery fÃ¶r att utfÃ¶ra uppgifter i bakgrunden. Vissa uppgifter utlÃ¶ses av hÃ¤ndelser, medan andra utlÃ¶ses av scheman.

source: The Celery Beat is used for scheduling tasks, and `django-celery-beat` is used to store the periodic task schedule in the database. The tasks schedule is configured in :file:`tasks.py` in each of the Django apps.
sv: Celery Beat anvÃ¤nds fÃ¶r att schemalÃ¤gga uppgifter, och `django-celery-beat` anvÃ¤nds fÃ¶r att lagra det periodiska uppgiftsschemat i databasen. Uppgiftsschemat konfigureras i :file:`tasks.py` i var och en av Django-apparna.

source: The tasks are consumed using several queues; the routing is configured in :file:`settings.py`. The queues were designed to separate different types of workload:
sv: Uppgifterna hanteras med hjÃ¤lp av flera kÃ¶er; routningen konfigureras i :file:`settings.py`. KÃ¶erna har utformats fÃ¶r att separera olika typer av arbetsbelastning:

source: The default queue where background tasks are processed.
sv: StandardkÃ¶n dÃ¤r bakgrundsuppgifter behandlas.

source: Delivers notification e-mails, both for events within Weblate and for authentication or registration. This is a separate queue to make e-mail delivery smooth even if there is a backlog of other tasks.
sv: Levererar e-postmeddelanden, bÃ¥de fÃ¶r hÃ¤ndelser inom Weblate och fÃ¶r autentisering eller registrering. Detta Ã¤r en separat kÃ¶ fÃ¶r att gÃ¶ra e-postleveransen smidig Ã¤ven om det finns en efterslÃ¤pning av andra uppgifter.

source: Updates translation memory entries. The updating queue can be long when importing new strings, and long processing does not matter much here, so having a separate queue avoids blocking other tasks.
sv: Uppdaterar Ã¶versÃ¤ttningsminnets poster. UppdateringskÃ¶n kan bli lÃ¥ng nÃ¤r nya strÃ¤ngar importeras, och lÃ¥ng bearbetningstid spelar ingen stÃ¶rre roll hÃ¤r, sÃ¥ en separat kÃ¶ fÃ¶rhindrar att andra uppgifter blockeras.

source: The backup tasks cannot be executed in parallel, and a single dedicated worker makes this easier.
sv: SÃ¤kerhetskopieringsuppgifterna kan inte utfÃ¶ras parallellt, och en enda dedikerad arbetare underlÃ¤ttar detta.

source: Automatic translation tasks are known to take long because they hit external services.
sv: Automatiska Ã¶versÃ¤ttningsuppgifter Ã¤r kÃ¤nda fÃ¶r att ta lÃ¥ng tid eftersom de anvÃ¤nder externa tjÃ¤nster.

source: Reporting issues in Weblate
sv: Rapportera problem i Weblate

source: Weblate `issue tracker <https://github.com/WeblateOrg/weblate/issues>`_ is hosted at GitHub.
sv: Weblate `issue tracker <https://github.com/WeblateOrg/weblate/issues>`_ finns pÃ¥ GitHub.

source: Feel welcome to report any issues you have or suggest improvements for Weblate there. There are various templates prepared to comfortably guide you through the issue report.
sv: VÃ¤lkommen att rapportera eventuella problem eller fÃ¶reslÃ¥ fÃ¶rbÃ¤ttringar fÃ¶r Weblate dÃ¤r. Det finns olika mallar som hjÃ¤lper dig att fylla i felrapporten pÃ¥ ett smidigt sÃ¤tt.

source: If what you have found is a security issue in Weblate, please see :ref:`security`.
sv: Om du har upptÃ¤ckt ett sÃ¤kerhetsproblem i Weblate, se :ref:`security`.

source: If you are not sure about your bug report or feature request, you can try :ref:`discussions`.
sv: Om du Ã¤r osÃ¤ker pÃ¥ din felrapport eller funktionsfÃ¶rfrÃ¥gan kan du prova :ref:`discussions`.

source: Using AI to create issues
sv: AnvÃ¤nda AI fÃ¶r att skapa problem

source: If you asked an AI tool to find problems in Weblate or its modules, you **must** make sure to reveal this fact in your report.
sv: Om du har bett ett AI-verktyg att hitta problem i Weblate eller dess moduler, **mÃ¥ste** du se till att uppge detta i din rapport.

source: You must also double-check the findings carefully before reporting them to us to validate that the issues are indeed existing and working exactly as the AI says. AI-based tools frequently generate inaccurate or fabricated results.
sv: Du mÃ¥ste ocksÃ¥ noggrant dubbelkolla resultaten innan du rapporterar dem till oss fÃ¶r att bekrÃ¤fta att problemen verkligen finns och fungerar precis som AI sÃ¤ger. AI-baserade verktyg genererar ofta felaktiga eller pÃ¥hittade resultat.

source: It is *rarely* a good idea to just copy and paste an AI-generated report to the project. Those generated reports typically are too wordy and rarely to the point (in addition to the common fabricated details). If you actually discover a issue with an AI and you have verified it yourself to be true, write the report yourself and explain the issue as you have learned it. This makes sure the AI-generated inaccuracies and invented issues are filtered out early before they waste more people's time.
sv: Det Ã¤r *sÃ¤llan* en bra idÃ© att bara kopiera och klistra in en AI-genererad rapport i projektet. Dessa genererade rapporter Ã¤r vanligtvis fÃ¶r ordrika och sÃ¤llan relevanta (fÃ¶rutom de vanliga pÃ¥hittade detaljerna). Om du upptÃ¤cker ett problem med en AI och sjÃ¤lv har verifierat att det Ã¤r sant, skriv rapporten sjÃ¤lv och fÃ¶rklara problemet sÃ¥ som du har fÃ¶rstÃ¥tt det. Detta sÃ¤kerstÃ¤ller att AI-genererade felaktigheter och pÃ¥hittade problem filtreras bort tidigt innan de slÃ¶sar bort mer tid fÃ¶r andra.

source: As we take security reports seriously, we investigate each report with priority. This work is both time- and energy-consuming and pulls us away from doing other meaningful work. Fake and otherwise made-up security issues effectively prevent us from doing real project work and make us waste time and resources.
sv: Eftersom vi tar sÃ¤kerhetsrapporter pÃ¥ allvar undersÃ¶ker vi varje rapport med hÃ¶g prioritet. Detta arbete Ã¤r bÃ¥de tids- och energikrÃ¤vande och hindrar oss frÃ¥n att utfÃ¶ra annat meningsfullt arbete. Falska och pÃ¥hittade sÃ¤kerhetsproblem hindrar oss effektivt frÃ¥n att utfÃ¶ra verkligt projektarbete och gÃ¶r att vi slÃ¶sar bort tid och resurser.

source: We ban users immediately who submit made-up fake reports to the project.
sv: Vi stÃ¤nger omedelbart av anvÃ¤ndare som skickar in pÃ¥hittade falska rapporter till projektet.

source: Issues lifecycle
sv: Problemets livscykel

source: Weblate license
sv: Weblate-licens

source: Machine-readable licensing information
sv: MaskinlÃ¤sbar licensinformation

source: Weblate comes with `REUSE 3.3 <https://reuse.software/>`_ compliant license specification in the source code.
sv: Weblate levereras med en licensspecifikation som Ã¶verensstÃ¤mmer med `REUSE 3.3 <https://reuse.software/>`_ i kÃ¤llkoden.

source: To review licensing of Weblate dependencies please see :ref:`sbom`.
sv: FÃ¶r att granska licensiering av Weblate-beroenden, se :ref:`sbom`.

source: License terms
sv: Licensvillkor

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
sv: Detta program Ã¤r fri programvara: du kan distribuera och/eller modifiera det enligt villkoren i GNU General Public License som publicerats av Free Software Foundation, antingen version 3 av licensen eller (efter eget val) nÃ¥gon senare version.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sv: Detta program distribueras i hopp om att det ska vara anvÃ¤ndbart, men UTAN NÃ GON GARANTI; utan ens den underfÃ¶rstÃ¥dda garantin om SÃLJBARHET eller LÃMPLIGHET FÃR ETT VISST SYFTE. Se GNU General Public License fÃ¶r mer information.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <https://www.gnu.org/licenses/>.
sv: Du bÃ¶r ha fÃ¥tt en kopia av GNU General Public License tillsammans med detta program. Om inte, se <https://www.gnu.org/licenses/>.

source: Weblate modules license
sv: Weblate-modulernas licens

source: Some Weblate modules use MIT or ISC licenses. Please check the respective repositories for the actual license.
sv: Vissa Weblate-moduler anvÃ¤nder MIT- eller ISC-licenser. Kontrollera respektive arkiv fÃ¶r den aktuella licensen.

source: Contributing to Weblate modules
sv: Bidra till Weblate-moduler

source: Besides the main repository, Weblate consists of several Python modules. All these follow same structure and this documentation covers them all.
sv: FÃ¶rutom huvudarkivet bestÃ¥r Weblate av flera Python-moduler. Alla dessa fÃ¶ljer samma struktur och denna dokumentation tÃ¤cker dem alla.

source: For example, this covers:
sv: Detta omfattar till exempel:

source: `wlc <https://github.com/WeblateOrg/wlc/>`_, Python client library, see :ref:`wlc`
sv: `wlc <https://github.com/WeblateOrg/wlc/>`_, Python-klientbibliotek, se :ref:`wlc`

source: `translation-finder <https://github.com/WeblateOrg/translation-finder/>`_, used to discover translatable files in the repository
sv: `translation-finder <https://github.com/WeblateOrg/translation-finder/>`_, anvÃ¤nds fÃ¶r att hitta Ã¶versÃ¤ttningsbara filer i arkivet

source: `language-data`_, language definitions for Weblate, see :ref:`languages`
sv: `language-data`_, sprÃ¥kinformation fÃ¶r Weblate, se :ref:`languages`

source: Extending built-in language definitions
sv: UtÃ¶ka inbyggda sprÃ¥kteckningar

source: The language definitions are in the `language-data`_ repository.
sv: SprÃ¥kreferenserna finns i `language-data`_-arkivet.

source: You are welcome to add missing language definitions to :file:`languages.csv`, other files are generated from that file. The columns in the CSV file correspond to :ref:`language-definitions`.
sv: Du Ã¤r vÃ¤lkommen att lÃ¤gga till saknade sprÃ¥ldefinitioner till :file:`languages.csv`, andra filer genereras frÃ¥n den filen. Kolumnerna i CSV-filen motsvarar :ref:`language-definitions`.

source: Releasing Weblate
sv: SlÃ¤ppa Weblate

source: Release cycle
sv: Utgivningscykel
